package org.javaguru.student_grigoriy_emiliyanov.lesson_2.lessoncode;

//Написать программу, которая печатает
//        ваше имя в одной строке и фамилию в другой строке на консоль.
public class PrintNameNewLine {
    public static void main(String[] args) {
        String firstName = "Vasya";
        String lastName = "Pupkin";
        System.out.println(firstName);
        System.out.println(lastName);
    }
}
