package org.javaguru.student_grigoriy_emiliyanov.lesson_2.lessoncode;

//Напишите программу, которая складывает два числа и выводит
//        результат на консоль.
public class Sum {
    public static void main(String[] args) {
        int firstNum = 100;
        int secondNum = 200;
        int result = firstNum + secondNum;
        System.out.println(result);
    }
}
