package org.javaguru.student_grigoriy_emiliyanov.lesson_2.homework.level_4;

//Напишите программу, которая демонстрирует использование команды
//        System.out.print("text");
public class PrintWithoutCR {
    public static void main(String[] args) {
        System.out.print("text");
    }
}
